---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.GetColor
source: html/0f6e7ddf-e1f7-42f3-56b5-9979ebf39563.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.GetColor Method

Gets the vertex's color.

## Syntax (C#)
```csharp
public ColorWithTransparency GetColor()
```

## Returns
The vertex's color.